# Ejercicios Pandas

In [1]:
import numpy as np
import pandas as pd

___

## Parte I

-  Crea un dataframe a partir de la siguiente lista y diccionario.

In [3]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [50]:
df = pd.DataFrame(data, index = labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

-  Muestra una descripci√≥n de los datos.

In [30]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

-  Muestra las 2 primeras filas.

In [7]:
df.head(2)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes

-  Muestra la tercera columna.

In [34]:
df.iloc[:,2]

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: visits, dtype: int64

-  Selecciona las columnas animal y age.

In [23]:
df.iloc[:, [0,1]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

-  Elimina una de las columnas.

In [25]:
df2=df.drop("age",axis=1)
df2

  animal  visits priority
a    cat       1      yes
b    cat       3      yes
c  snake       2       no
d    dog       3      yes
e    dog       2       no
f    cat       3       no
g  snake       1       no
h    cat       1      yes
i    dog       2       no
j    dog       1       no

-  Elimina una de las filas.

In [27]:
df3=df.drop("j",axis=0)
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no

-  Crea una columna nueva con los valores que quieras

In [36]:
df3["unamas"]=range(9)
df3

  animal  age  visits priority  unamas
a    cat  2.5       1      yes       0
b    cat  3.0       3      yes       1
c  snake  0.5       2       no       2
d    dog  NaN       3      yes       3
e    dog  5.0       2       no       4
f    cat  2.0       3       no       5
g  snake  4.5       1       no       6
h    cat  NaN       1      yes       7
i    dog  7.0       2       no       8

---

## Parte II

- Seleciona los datos en las filas 3, 4 y 8 y en las columnas  animal y age.

In [79]:
df.iloc[[2, 3,7].loc['animal', 'age']]

AttributeError: 'list' object has no attribute 'loc'

- Reindexa el dataframe usando n√∫meros secuenciales empezando por el cero.

In [81]:
df.index=range(df.shape[0])
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

- Seleciona las filas donde el n√∫mero de vistas es mayor que 2.

In [82]:
df[df.visits>2]

  animal  age  visits priority
1    cat  3.0       3      yes
3    dog  NaN       3      yes
5    cat  2.0       3       no

- Usando los siguientes dataframe:

In [84]:
df_a = pd.DataFrame(np.random.randint(1, 10, 10),
                    index=np.arange(1, 11))
df_a
df_b = pd.DataFrame(np.random.randint(1, 10, 10),
                    index=np.arange(0, 10))

- Calcula la resta de ambos y entiende el resultado.

In [86]:
df_a.subtract(df_b, fill_value=0)

      0
0  -8.0
1  -1.0
2   2.0
3  -1.0
4   0.0
5  -5.0
6   2.0
7   0.0
8   0.0
9   0.0
10  7.0

- Utilizando el siguiente dataframe:

In [88]:
df = pd.DataFrame({"price": [5,2,3,1,4,5,6,7,8,3,4,8,9],
                   "hours"    :[1,9,6,5,3,9,2,9,1,7,4,2,2],
                   "happiness"   :[2,1,3,2,3,1,2,3,1,2,2,1,3],
                   "caffienated" :[0,0,1,1,0,0,0,0,1,1,0,1,0]})

- Calcula la media del precio.

In [90]:
df.price.mean()
df["price"].mean()

5.0

- Calcula la mutltiplicaci√≥n de price x hours.

In [91]:
df.price*df.hours

0      5
1     18
2     18
3      5
4     12
5     45
6     12
7     63
8      8
9     21
10    16
11    16
12    18
dtype: int64

- Crea un funci√≥n que retorne 'coffee', cuando reciba 1 y 'nothing' cuando reciba 0.

In [94]:
my_fun=lambda x: "coffee" if x==1 else "nothing"
my_fun(0)

'nothing'

- Cambia los valores de la columna caffienated us√°ndola.

In [98]:
df["caffienated"]=df.caffienated.apply(my_fun)

In [99]:
df

    price  hours  happiness caffienated
0       5      1          2     nothing
1       2      9          1     nothing
2       3      6          3      coffee
3       1      5          2      coffee
4       4      3          3     nothing
5       5      9          1     nothing
6       6      2          2     nothing
7       7      9          3     nothing
8       8      1          1      coffee
9       3      7          2      coffee
10      4      4          2     nothing
11      8      2          1      coffee
12      9      2          3     nothing